name: "DeepFace_set003_net"
layers {
  name: "data"
  type:DATA
  top: "data"
  top: "label"
  data_param{
	  source: "/home/xiang.wu/data/lmdb/vehicle_train_set200_list_rng7610_lmdb"
	  backend: LMDB
	  batch_size: 128
	}
  transform_param {
    scale: 0.00390625
    crop_size: 64
    mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "data"
  type: DATA
  top: "data"
  top: "label"
  data_param{
	  source: "/home/xiang.wu/data/lmdb/vehicle_train_set200_list_rng7610_lmdb"
	  backend: LMDB
	  batch_size: 100
	}
  transform_param {
    scale: 0.00390625
    crop_size: 64
    mirror: false
  }
  include: { phase: TEST }
}

layers{
  name: "conv1"
  type: CONVOLUTION

  convolution_param {
	num_output: 48
	kernel_size: 9
	stride: 1
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}
  }
  bottom: "data"
  top: "conv1"
}

layers{
  name: "pool1"
  type: POOLING
  pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
  }
  bottom: "conv1"
  top: "pool1"
}

layers{
  name: "slice1"
  type:SLICE
  slice_param {
	slice_dim: 1
  }
  bottom: "pool1"
  top: "slice1_1"
  top: "slice1_2"
}

layers{
  name: "etlwise1"
  type: ELTWISE
  bottom: "slice1_1"
  bottom: "slice1_2"
  top: "eltwise1"
  eltwise_param {
	operation: MAX
  }
}

layers{
  name: "conv2"
  type: CONVOLUTION

  convolution_param {
	num_output: 96
	kernel_size: 5
	stride: 1
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}
  }
  bottom: "eltwise1"
  top: "conv2"
}
layers{
  name: "pool2"
  type: POOLING
  pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
  }
  bottom: "conv2"
  top: "pool2"
}


layers{
  name: "slice2"
  type:SLICE
  slice_param {
	slice_dim: 1
  }
  bottom: "pool2"
  top: "slice2_1"
  top: "slice2_2"
}

layers{
  name: "etlwise2"
  type: ELTWISE
  bottom: "slice2_1"
  bottom: "slice2_2"
  top: "eltwise2"
  
  eltwise_param {
	operation: MAX
  }
}

layers{
  name: "conv3"
  type: CONVOLUTION

  convolution_param {
	num_output: 128
	kernel_size: 5
	stride: 1
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}
  }
  bottom: "eltwise2"
  top: "conv3"
}

layers{
  name: "pool3"
  type: POOLING
  pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
  }
  bottom: "conv3"
  top: "pool3"
}

layers{
  name: "slice3"
  type:SLICE
  slice_param {
	slice_dim: 1
  }
  bottom: "pool3"
  top: "slice3_1"
  top: "slice3_2"
}

layers{
  name: "etlwise3"
  type: ELTWISE
  bottom: "slice3_1"
  bottom: "slice3_2"
  top: "eltwise3"
  eltwise_param {
	operation: MAX
  }
}
layers{
  name: "fc1_conv"
  type: CONVOLUTION

  convolution_param {
	num_output: 256
	kernel_size: 4
	stride: 1
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}
  }
  bottom: "eltwise3"
  top: "fc1_conv"
}

layers{
  name: "slice4"
  type:SLICE
  slice_param {
	slice_dim: 1
  }
  bottom: "fc1_conv"
  top: "slice4_1"
  top: "slice4_2"
}

layers{
  name: "fc1_conv_elt"
  type: ELTWISE
  bottom: "slice4_1"
  bottom: "slice4_2"
  top: "fc1_conv_elt"
  eltwise_param {
	operation: MAX
  }
}



layers {
	name: "dropout1"
	type: DROPOUT
	bottom: "fc1_conv_elt"
	top: "dropout1"	
	dropout_param {
		dropout_ratio: 0.5
  }
}

layers{
  name: "fc2_conv"
  type: CONVOLUTION

  convolution_param {
	num_output: 2
	kernel_size: 1
	stride: 1
	weight_filler {
	  type: "xavier"
	}
	bias_filler {
	  type: "constant"
	  value: 0.1
	}
  }
  bottom: "dropout1"
  top: "fc2_conv"
}

layers {
  name: "softmax"
  type: SOFTMAX
  bottom: "fc2_conv"
  top: "prob"
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "prob"
  bottom: "label"
  top: "accuracy"
}

layers{
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "fc2_conv"
  bottom: "label"
  loss_weight: 1 
}

